RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer0.c
/* Parameter validity check for common trigger. */
#define IS_VALID_TIM0_COM_TRIGGER(x)                                           \
(   ((x) == Tim0ComTrigger_1)                  ||                              \
    ((x) == Tim0ComTrigger_2)                  ||                              \
    ((x) == Tim0ComTrigger_1_2))

/* Delay count for time out */
#define TIMER0_TMOUT (0x5000ul)
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief Get clock mode
 **
 ** \param [in] pstcTim0Reg       Pointer to Timer0 register
 **
 ** \param [in] enCh              channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \retval Tim0_Sync:            Synchronous clock
 ** \retval Tim0_Async:           Asynchronous clock
 **
 ******************************************************************************/
static en_tim0_counter_mode_t TIMER0_GetClkMode(M4_TMR0_TypeDef* pstcTim0Reg, en_tim0_channel_t enCh)
{
    en_tim0_counter_mode_t enMode = Tim0_Sync;
    DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
    DDL_ASSERT(IS_VALID_CHANNEL(enCh));

    switch(enCh)
    {
        case Tim0_ChannelA:
            enMode = (en_tim0_counter_mode_t)pstcTim0Reg->BCONR_f.SYNSA;
            break;
        case Tim0_ChannelB:
            enMode = (en_tim0_counter_mode_t)pstcTim0Reg->BCONR_f.SYNSB;
            break;
        default:
            break;
    }
    return enMode;
}

/**
 *******************************************************************************
 ** \brief Time delay for register write in asynchronous mode
 **
 ** \param [in] pstcTim0Reg       Pointer to Timer0 register
 **
 ** \param [in] enCh              Channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \param [in] enIsPublicReg     Enable for BCONR and STFLR register delay
 **
 ** \retval None
 **
 ******************************************************************************/
static void AsyncDelay(M4_TMR0_TypeDef* pstcTim0Reg, en_tim0_channel_t enCh,
                       en_functional_state_t enIsPublicReg)
{
    en_functional_state_t enDelayEn = Disable;
    en_tim0_counter_mode_t enModeA = TIMER0_GetClkMode(pstcTim0Reg, Tim0_ChannelA);
    en_tim0_counter_mode_t enModeB = TIMER0_GetClkMode(pstcTim0Reg, Tim0_ChannelB);

    if(Enable == enIsPublicReg)
    {
        if((Tim0_Async == enModeA) || (Tim0_Async == enModeB))
        {
            enDelayEn = Enable;
        }
    }
    else
    {
        if(Tim0_Async == TIMER0_GetClkMode(pstcTim0Reg, enCh))
        {
            enDelayEn = Enable;
        }
    }

    if(Enable == enDelayEn)
    {
        for(uint32_t i=0ul; i<SystemCoreClock/10000ul; i++)
        {
            __NOP();
        }
    }
}

/**
 *******************************************************************************
 ** \brief Get Timer0 status flag
 **
 ** \param [in] pstcTim0Reg       Pointer to Timer0 register
 **
 ** \param [in] enCh              channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \retval Set        Flag is set
 **         Reset      Flag is reset
 **
 ******************************************************************************/
en_flag_status_t TIMER0_GetFlag(M4_TMR0_TypeDef* pstcTim0Reg, en_tim0_channel_t enCh)
{
    en_flag_status_t enFlag = Reset;
    DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
    DDL_ASSERT(IS_VALID_CHANNEL(enCh));

    switch(enCh)
    {
        case Tim0_ChannelA:
            enFlag = (en_flag_status_t)pstcTim0Reg->STFLR_f.CMAF;
            break;
        case Tim0_ChannelB:
            enFlag = (en_flag_status_t)pstcTim0Reg->STFLR_f.CMBF;
            break;
        default:
            break;
    }
    return enFlag;
}

/**
 *******************************************************************************
 ** \brief Clear Timer0 status flag
 **
 ** \param [in] pstcTim0Reg       Pointer to Timer0 register
 **
 ** \param [in] enCh              Timer0 channel, Timer0_ChA or Timer0_ChB
 **
 ** \retval Ok                    Success
 ** \retval ErrorTimeout          Process timeout
 **
 ******************************************************************************/
en_result_t TIMER0_ClearFlag(M4_TMR0_TypeDef* pstcTim0Reg, en_tim0_channel_t enCh)
{
    en_result_t enRet = Ok;
    uint32_t u32TimeOut = 0ul;
    DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
    DDL_ASSERT(IS_VALID_CHANNEL(enCh));

    if(Tim0_ChannelA == enCh)
    {
        pstcTim0Reg->STFLR_f.CMAF =0u;
        AsyncDelay(pstcTim0Reg, enCh, Enable);
        while(0u != pstcTim0Reg->STFLR_f.CMAF)
        {
            if(u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
    }
    else
    {
        pstcTim0Reg->STFLR_f.CMBF = 0u;
        AsyncDelay(pstcTim0Reg, enCh, Enable);
        while(0u != pstcTim0Reg->STFLR_f.CMBF)
        {
            if(u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief Command the timer0 function
 **
 ** \param [in] pstcTim0Reg       Pointer to Timer0 register
 **
 ** \param [in] enCh              Timer0 channel, Timer0_ChA or Timer0_ChB
 **
 ** \param [in] enCmd             Disable or Enable the function
 **
 ** \retval Ok                    Success
 ** \retval ErrorTimeout          Process timeout
 **
 ******************************************************************************/
en_result_t TIMER0_Cmd(M4_TMR0_TypeDef* pstcTim0Reg, en_tim0_channel_t enCh,
                en_functional_state_t enCmd)
{
    en_result_t enRet = Ok;
    uint32_t u32TimeOut = 0ul;
    DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
    DDL_ASSERT(IS_VALID_CHANNEL(enCh));
    DDL_ASSERT(IS_VALID_COMMAND(enCmd));

    switch (enCh)
    {
        case Tim0_ChannelA:
            pstcTim0Reg->BCONR_f.CSTA = enCmd;
            AsyncDelay(pstcTim0Reg, enCh, Enable);
            while(enCmd != pstcTim0Reg->BCONR_f.CSTA)
            {
                if(u32TimeOut++ > TIMER0_TMOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }
            break;
        case Tim0_ChannelB:
            pstcTim0Reg->BCONR_f.CSTB = enCmd;
            AsyncDelay(pstcTim0Reg, enCh, Enable);
            while(enCmd != pstcTim0Reg->BCONR_f.CSTB)
            {
                if(u32TimeOut++ > TIMER0_TMOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }
            break;
        default:
            break;
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief Select the timer0 function mode
 **
 ** \param [in] pstcTim0Reg       Pointer to Timer0 register
 **
 ** \param [in] enCh              Timer0 channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \param [in] enFunc            Timer0 function,Tim0_OutputCapare or Tim0_InputCapture
 **
 ** \retval Ok                    Success
 ** \retval ErrorTimeout          Process timeout
 **
 ******************************************************************************/
en_result_t TIMER0_SetFunc(M4_TMR0_TypeDef* pstcTim0Reg, en_tim0_channel_t enCh,
                       en_tim0_function_t enFunc)
{
    en_result_t enRet = Ok;
    uint32_t u32TimeOut = 0ul;

