RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer0.c
    if (NULL != pstcBaseInit)
    {
        DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
        DDL_ASSERT(IS_VALID_CHANNEL(enCh));
        DDL_ASSERT(IS_VALID_CLK_DIVISION(pstcBaseInit->Tim0_ClockDivision));
        DDL_ASSERT(IS_VALID_CLK_SYN_SRC(pstcBaseInit->Tim0_SyncClockSource));
        DDL_ASSERT(IS_VALID_CLK_ASYN_SRC(pstcBaseInit->Tim0_AsyncClockSource));
        DDL_ASSERT(IS_VALID_CLK_MODE(pstcBaseInit->Tim0_CounterMode));

        if((M4_TMR01 == pstcTim0Reg)&&(Tim0_ChannelA == enCh))
        {
            DDL_ASSERT(IS_VALID_CLK_MODE_UNIT01(pstcBaseInit->Tim0_CounterMode));
        }

        /*Read current BCONR register */
        stcBconrTmp = pstcTim0Reg->BCONR_f;
        /* Clear current configurate CH */
        if(Tim0_ChannelA == enCh)
        {
            *(uint32_t *)&stcBconrTmp &= 0xFFFF0000ul;
        }
        else
        {
            *(uint32_t *)&stcBconrTmp &= 0x0000FFFFul;
        }
        pstcTim0Reg->BCONR_f = stcBconrTmp;
        AsyncDelay(pstcTim0Reg, enCh, Enable);
        while(*(uint32_t *)&stcBconrTmp != *(uint32_t *)&(pstcTim0Reg->BCONR_f))
        {
            if(u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }

        switch(enCh)
        {
            case Tim0_ChannelA:

                switch(pstcBaseInit->Tim0_CounterMode)
                {
                    case Tim0_Sync:
                        stcBconrTmp.SYNCLKA = pstcBaseInit->Tim0_SyncClockSource;
                        break;
                    case Tim0_Async:
                        stcBconrTmp.ASYNCLKA = pstcBaseInit->Tim0_AsyncClockSource;
                        break;
                    default:
                        break;
                }
                /*set clock division*/
                stcBconrTmp.CKDIVA = pstcBaseInit->Tim0_ClockDivision;
                /* Write BCONR register */
                pstcTim0Reg->BCONR_f = stcBconrTmp;
                AsyncDelay(pstcTim0Reg, enCh, Enable);

                /*set timer compare value*/
                pstcTim0Reg->CMPAR = pstcBaseInit->Tim0_CmpValue;
                AsyncDelay(pstcTim0Reg, enCh, Enable);

                /*set timer counter mode*/
                pstcTim0Reg->BCONR_f.SYNSA = pstcBaseInit->Tim0_CounterMode;
                AsyncDelay(pstcTim0Reg, enCh, Enable);
                u32TimeOut = 0ul;
                while(pstcBaseInit->Tim0_CounterMode != pstcTim0Reg->BCONR_f.SYNSA)
                {
                    if(u32TimeOut++ > TIMER0_TMOUT)
                    {
                        enRet = ErrorTimeout;
                        break;
                    }
                }

                break;

            case Tim0_ChannelB:
                switch(pstcBaseInit->Tim0_CounterMode)
                {
                    case Tim0_Sync:
                        stcBconrTmp.SYNCLKB = pstcBaseInit->Tim0_SyncClockSource;
                        break;
                    case Tim0_Async:
                        stcBconrTmp.ASYNCLKB = pstcBaseInit->Tim0_AsyncClockSource;
                        break;
                    default:
                        break;
                }
                /*set clock division*/
                stcBconrTmp.CKDIVB = pstcBaseInit->Tim0_ClockDivision;
                /* Write BCONR register */
                pstcTim0Reg->BCONR_f = stcBconrTmp;
                AsyncDelay(pstcTim0Reg, enCh, Enable);

                /*set timer compare value*/
                pstcTim0Reg->CMPBR = pstcBaseInit->Tim0_CmpValue;
                AsyncDelay(pstcTim0Reg, enCh, Enable);

                /*set timer counter mode*/
                pstcTim0Reg->BCONR_f.SYNSB = pstcBaseInit->Tim0_CounterMode;
                AsyncDelay(pstcTim0Reg, enCh, Enable);
                u32TimeOut = 0ul;
                while(pstcBaseInit->Tim0_CounterMode != pstcTim0Reg->BCONR_f.SYNSB)
                {
                    if(u32TimeOut++ > TIMER0_TMOUT)
                    {
                        enRet = ErrorTimeout;
                        break;
                    }
                }
                break;

            default:
                break;
        }
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Timer0 peripheral base function initalize
 **
 ** \param [in] pstcTim0Reg     Pointer to Timer0 register
 **
 ** \param [in] enCh            Timer0 channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \retval Ok                  Process finished.
 ** \retval ErrorTimeout        Process timeout
 **
 ******************************************************************************/
en_result_t TIMER0_DeInit(M4_TMR0_TypeDef* pstcTim0Reg,en_tim0_channel_t enCh)
{
    en_result_t enRet = Ok;
    uint32_t u32TimeOut = 0ul;

    DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
    DDL_ASSERT(IS_VALID_CHANNEL(enCh));

    switch(enCh)
    {
        case Tim0_ChannelA:
            pstcTim0Reg->BCONR &= 0xFFFF0000ul;
            AsyncDelay(pstcTim0Reg, enCh, Enable);
            while(0ul != (pstcTim0Reg->BCONR & 0x0000FFFFul))
            {
                if(u32TimeOut++ > TIMER0_TMOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }

            pstcTim0Reg->CMPAR = 0x0000FFFFul;
            pstcTim0Reg->CNTAR = 0x00000000ul;
            pstcTim0Reg->STFLR_f.CMAF =0u;
            break;

        case Tim0_ChannelB:
            pstcTim0Reg->BCONR &= 0x0000FFFFul;
            AsyncDelay(pstcTim0Reg, enCh, Enable);
            while(0ul != (pstcTim0Reg->BCONR & 0xFFFF0000ul))
            {
                if(u32TimeOut++ > TIMER0_TMOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }

            pstcTim0Reg->CMPBR = 0x0000FFFFul;
            pstcTim0Reg->CNTBR = 0x00000000ul;
            pstcTim0Reg->STFLR_f.CMBF =0u;
            break;
        default:
            break;
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set external trigger source for Timer0
 **
 ** \param [in] enEvent         External event source
 **
 ** \retval None
 **
 ******************************************************************************/
void TIMER0_SetTriggerSrc(en_event_src_t enEvent)
{
    DDL_ASSERT(IS_VALID_TRIG_SRC_EVENT(enEvent));

    M4_AOS->TMR0_HTSSR_f.TRGSEL = enEvent;
}

/**
 *******************************************************************************
 ** \brief  Enable or disable Timer0 common trigger.
 **
 ** \param [in] enComTrigger            Timer0 common trigger selection. See @ref en_tim0_com_trigger_t for details.
 ** \param [in] enState                 Enable or disable the specified common trigger.
 **
 ** \retval None
 **
 ******************************************************************************/
void TIMER0_ComTriggerCmd(en_tim0_com_trigger_t enComTrigger, en_functional_state_t enState)
{
    uint32_t u32ComTrig = (uint32_t)enComTrigger;

    DDL_ASSERT(IS_VALID_TIM0_COM_TRIGGER(enComTrigger));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));

    if (enState == Enable)
    {
        M4_AOS->TMR0_HTSSR |= (u32ComTrig << 30u);
    }
    else
    {
        M4_AOS->TMR0_HTSSR &= ~(u32ComTrig << 30u);
    }
}

/**
 *******************************************************************************
 ** \brief  Timer0 hardware trigger function initalize
 **
 ** \param [in] pstcTim0Reg     Pointer to Timer0 register
 **
 ** \param [in] enCh            Timer0 channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \param [in] pStcInit        Timer0 hareware trigger function structure
 **
 ** \retval Ok                      Process finished.
 ** \retval ErrorInvalidParameter   Parameter error.
 **
 ******************************************************************************/
en_result_t TIMER0_HardTriggerInit(M4_TMR0_TypeDef* pstcTim0Reg,en_tim0_channel_t enCh,
                                const stc_tim0_trigger_init_t* pStcInit)
{
    stc_tmr0_bconr_field_t stcBconrTmp;
    en_result_t enRet = Ok;

    if(NULL != pStcInit)
    {
        DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
        DDL_ASSERT(IS_VALID_CHANNEL(enCh));
        DDL_ASSERT(IS_VALID_FUNCTION(pStcInit->Tim0_OCMode));
        DDL_ASSERT(IS_VALID_TRIG_SRC_EVENT(pStcInit->Tim0_SelTrigSrc));

        /*Read current BCONR register */
        stcBconrTmp = pstcTim0Reg->BCONR_f;

        switch(enCh)
        {
            case Tim0_ChannelA:
                /*set work on input captrue or output capare*/
                stcBconrTmp.CAPMDA = pStcInit->Tim0_OCMode;
                /*enable input capture*/
                stcBconrTmp.HICPA = pStcInit->Tim0_InTrigEnable;
                /*enable trigger clear counter*/
                stcBconrTmp.HCLEA = pStcInit->Tim0_InTrigClear;
                /*enable trigger start counter*/
                stcBconrTmp.HSTAA = pStcInit->Tim0_InTrigStart;
                /*enable trigger stop counter*/
                stcBconrTmp.HSTPA = pStcInit->Tim0_InTrigStop;

                /* Write BCONR register */
                pstcTim0Reg->BCONR_f = stcBconrTmp;
                break;
            case Tim0_ChannelB:
                /*set work on input captrue or output capare*/
                stcBconrTmp.CAPMDB = pStcInit->Tim0_OCMode;
                /*enable input capture*/
                stcBconrTmp.HICPB = pStcInit->Tim0_InTrigEnable;
                /*enable trigger clear counter*/
                stcBconrTmp.HCLEB = pStcInit->Tim0_InTrigClear;
                /*enable trigger start counter*/
                stcBconrTmp.HSTAB = pStcInit->Tim0_InTrigStart;
                /*enable trigger stop counter*/
                stcBconrTmp.HSTPB = pStcInit->Tim0_InTrigStop;

                /* Write BCONR register */
                pstcTim0Reg->BCONR_f = stcBconrTmp;
                break;
            default:
                break;
        }
        AsyncDelay(pstcTim0Reg, enCh, Enable);

        /* Set trigger source*/
        M4_AOS->TMR0_HTSSR_f.TRGSEL = pStcInit->Tim0_SelTrigSrc;
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;

}

//@} // Timer0Group

#endif /* DDL_TIMER0_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
